# -*- coding: utf-8 -*-
names = {
'宝山': 'Baoshan', 
'长宁': 'Changning', 
'崇明': 'Chongming', 
'奉贤': 'Fengxian', 
'虹口': 'Hongkou', 
'黄浦': 'Huangpu', 
'嘉定': 'Jiading', 
'静安': 'Jingan',
'金山': 'Jinshan', 
'卢湾': 'Luwan', 
'闵行': 'Minhang', 
'浦东': 'Pudong', 
'普陀': 'Putuo', 
'青浦': 'Qingpu', 
'松江': 'Songjiang', 
'徐汇': 'Xuhui', 
'杨浦': 'Yangpu', 
'闸北': 'Zhabei' }




district_population = {
'宝山': 202.29, 
'长宁': 69.11, 
'崇明': 70.16, 
'奉贤': 115.99, 
'虹口': 83.82, 
'黄浦': 68.2, 
'嘉定': 156.8, 
'静安': 109.71,
'金山': 79.71, 
'卢湾': 31.01, 
'闵行': 253.79, 
'浦东': 414.5, 
'普陀': 128.8, 
'青浦': 120.9, 
'松江': 176.02, 
'徐汇': 110.97, 
'杨浦': 132.37, 
'闸北': 29.26 }

district_size = {
'宝山': 293.71, 
'长宁': 38.3, 
'崇明': 1411.0, 
'奉贤': 704.68, 
'虹口': 23.4, 
'黄浦': 12.41, 
'嘉定': 463.55, 
'静安': 7.62,
'金山': 586.05, 
'卢湾': 8.05, 
'闵行': 370.75, 
'浦东': 1210.41, 
'普陀': 54.83, 
'青浦': 669.77, 
'松江': 604.67, 
'徐汇': 54.76, 
'杨浦': 60.61, 
'闸北': 29.26 }

